blog/implementation.org
# -*- org-html-htmlize-output-type: nil; org-html-postamble: nil; -*-

#+HTML_HEAD_EXTRA: <style>.meta { opacity: 0.75; margin-left: 1em; }</style>
#+HTML_HEAD_EXTRA: <style>.accordion { border: 1px solid #ccc; box-shadow: 3px 3px 3px #eee; padding: 0em 1em; margin-left: 1em; }</style>
#+HTML_HEAD_EXTRA: <style>.accordion-head { cursor: pointer; }</style>
#+HTML_HEAD_EXTRA: <style>.accordion-head > p:first-child { font-variant: small-caps; }</style>
#+HTML_HEAD_EXTRA: <style>.accordion-body { max-height: 0em; transform: scaleY(0); transition: transform 0.3s; transform-origin: top; }</style>
#+HTML_HEAD_EXTRA: <style>.accordion-body > p:first-child { margin-top: 0; padding-top: 0.5em; }</style>
#+HTML_HEAD_EXTRA: <style>.accordion-head > p:last-child { margin-bottom: 0; padding-bottom: 0.5em; }</style>
#+HTML_HEAD_EXTRA: <style>.accordion-body:hover { max-height: 10000em; transform: scaleY(1); }</style>
#+HTML_HEAD_EXTRA: <style>.accordion-head:hover + .accordion-body { max-height: 10000em; transform: scaleY(1); }</style>
#+HTML_HEAD_EXTRA: <style>.trigger { border: 1px solid #ccc; box-shadow: 3px 3px 3px #eee; padding: 0.5em 1em; margin-left: 1em; }</style>
#+HTML_HEAD_EXTRA: <style>.trigger:before { content: 'Trigger'; font-variant: small-caps; }</style>

* Prior knowledge

You have probably heard advice about breaking long functions into the composition of several smaller functions. (See, for example, [[https://dzone.com/articles/rule-30-%E2%80%93-when-method-class-or][When is a method, class or subsystem too big?]])

You have also perhaps heard admonitions that we should [[https://en.wikipedia.org/wiki/Dependency_inversion_principle][depend on abstractions rather than concretions]].

I contend that one goal underlying both pieces of advice is reducing the defect rate by limiting the number of incorrect implementations. When we break a long function into several smaller functions, each small function clearly has fewer implementations. But the collective whole does as well because we "pin" down type signatures at intermediate points. When we depend on abstractions, we prevent ourselves from accidentally depending on implementation details and thereby doing the wrong thing.

* Implementation space

Last time, we explored the idea that each type we declare permits only a certain number of inhabitants. Today, we'll extend this notion to function types. That is, each function type signature permits only a certain number of pure implementations (by "pure" we mean functions which don't fetch data over the network, generate random numbers, etc.---[[https://en.wikipedia.org/wiki/Pure_function][see here for more]]). We refer to this set of possible implementations as the "implementation space". Just like with "make illegal state unrepresentable", smaller implementation spaces are better (as long as they still permit the required business logic).

* Goals

- Understand the concept of "implementation space"
  - You'll know that you're on your way when you feel comfortable recalling the meaning of the term and can bring examples to mind
  - Check this goal off when you can generate and apply novel ways of reducing implementation space
- Learn some techniques for reducing implementation space
  - You'll know you're on your when you can complete the accompanying exercises
  - Check this goal off when you're regularly applying these techniques in your day-to-day code

* Another rigorous interlude

(Again, skip this section if you'd like.)

If you recall from last time, we found that when calculating cardinality of types unions corresponded to addition and tuples and records correspond to multiplication. For pure  functions, the corresponding operation is exponentiation.

In symbols (with ~σ(τ)~ representing the cardinality of ~tau~):

#+begin_src
σ(τ => φ) = σ(φ)^σ(τ)

We can start to convince ourselves it's true with examples like:

σ(null) = 1
σ(null => null) = σ(null)^σ(null) = 1^1

function(x: null): null {
  return in;
}

But wait. Can't we also write a function like the following with a conforming type signature:

function(x: null): null {
  const a = 'ab';
  return null;
}

Yes, but we count it as morally equivalent because it is observationally
indistinguishable (i.e. if we just treat the function as a black box, feed it
inputs, and record its outputs) from the earlier function. When we talk about
implementation space, we're really talking about the size of the input to output
mapping table. Which in this case is 1.

Another example:

type Level = 'High' | 'Medium' | 'Low'
σ(boolean) = 2
σ(Level) = 3
σ(boolean => Level) = σ(Level)^σ(boolean) = 3^2

function(x: boolean): Level { return x ? 'High' : 'High'; }
function(x: boolean): Level { return x ? 'High' : 'Medium'; }
function(x: boolean): Level { return x ? 'High' : 'Low'; }
function(x: boolean): Level { return x ? 'Medium' : 'High'; }
function(x: boolean): Level { return x ? 'Medium' : 'Medium'; }
function(x: boolean): Level { return x ? 'Medium' : 'Low'; }
function(x: boolean): Level { return x ? 'Low' : 'High'; }
function(x: boolean): Level { return x ? 'Low' : 'Medium'; }
function(x: boolean): Level { return x ? 'Low' : 'Low'; }
#+end_src

#+begin_accordion
#+begin_accordion-head
Practice

What's the cardinality of ~boolean => boolean~?
#+end_accordion-head
#+begin_accordion-body
#+begin_src
σ(boolean => boolean) = σ(boolean)^σ(boolean) = 2^2
function(x: boolean): boolean { return x ? true : true; }
function(x: boolean): boolean { return x ? true : false; }
function(x: boolean): boolean { return x ? false : true; }
function(x: boolean): boolean { return x ? false : false; }
#+end_src
#+end_accordion-body
#+end_accordion

Again, we strive for the type with the minimum cardinality which is still compatible with our business logic.

* How

** Make illegal state unrepresentable

One obvious extension of last week is choosing input and output types that make illegal state unrepresentable.

Compare ~promote: string => string~ to ~promote: Level -> Level~ (where ~type Level = 'High' | 'Medium' | 'Low'~).

This change reduces our implementation space from an infinite size to a size of nine.

