blog/implementation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-06 Fri 10:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Eric Easley" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0dc74e5">1. Prior knowledge</a></li>
<li><a href="#orgcb97836">2. Implementation space</a></li>
<li><a href="#org3226736">3. Goals</a></li>
<li><a href="#org2ee8331">4. Another rigorous interlude</a></li>
<li><a href="#org70e7eb4">5. How</a>
<ul>
<li><a href="#org0c8b796">5.1. Make illegal state unrepresentable</a></li>
<li><a href="#org31fccaf">5.2. Use generics</a></li>
<li><a href="#orga032d43">5.3. Project</a></li>
<li><a href="#orged8adbf">5.4. Import only what you need</a></li>
</ul>
</li>
<li><a href="#orga9d2766">6. Why</a>
<ul>
<li><a href="#org6c5de42">6.1. Code quality</a>
<ul>
<li><a href="#orga7db15c">6.1.1. Documentation</a></li>
<li><a href="#org572f638">6.1.2. Reuse</a></li>
<li><a href="#org177a2b0">6.1.3. Reliability</a></li>
</ul>
</li>
<li><a href="#org0f0e3a5">6.2. Cognitive science</a></li>
</ul>
</li>
<li><a href="#orge8ada00">7. Summary</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0dc74e5" class="outline-2">
<h2 id="org0dc74e5"><span class="section-number-2">1</span> Prior knowledge</h2>
<div class="outline-text-2" id="text-1">
<p>
You have probably heard advice about breaking long functions into the composition of several smaller functions. (See, for example, <a href="https://dzone.com/articles/rule-30-%E2%80%93-when-method-class-or">When is a method, class or subsystem too big?</a>)
</p>

<p>
You have also perhaps heard admonitions that we should <a href="https://en.wikipedia.org/wiki/Dependency_inversion_principle">depend on abstractions rather than concretions</a>.
</p>

<p>
I contend that one goal underlying both pieces of advice is reducing the defect rate by limiting the number of incorrect implementations. When we break a long function into several smaller functions, each small function clearly has fewer implementations. But the collective whole does as well because we "pin" down type signatures at intermediate points. When we depend on abstractions, we prevent ourselves from accidentally depending on implementation details and thereby doing the wrong thing.
</p>
</div>
</div>

<div id="outline-container-orgcb97836" class="outline-2">
<h2 id="orgcb97836"><span class="section-number-2">2</span> Implementation space</h2>
<div class="outline-text-2" id="text-2">
<p>
Last time, we explored the idea that each type we declare permits only a certain number of inhabitants. Today, we'll extend this notion to function types. That is, each function type signature permits only a certain number of pure implementations (by "pure" we mean functions which don't fetch data over the network, generate random numbers, etc.---<a href="https://en.wikipedia.org/wiki/Pure_function">see here for more</a>). We refer to this set of possible implementations as the "implementation space". Just like with "make illegal state unrepresentable", smaller implementation spaces are better (as long as they still permit the required business logic).
</p>
</div>
</div>

<div id="outline-container-org3226736" class="outline-2">
<h2 id="org3226736"><span class="section-number-2">3</span> Goals</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Understand the concept of "implementation space"
<ul class="org-ul">
<li>You'll know that you're on your way when you feel comfortable recalling the meaning of the term and can bring examples to mind</li>
<li>Check this goal off when you can generate and apply novel ways of reducing implementation space</li>
</ul></li>
<li>Learn some techniques for reducing implementation space
<ul class="org-ul">
<li>You'll know you're on your when you can complete the accompanying exercises</li>
<li>Check this goal off when you're regularly applying these techniques in your day-to-day code</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org2ee8331" class="outline-2">
<h2 id="org2ee8331"><span class="section-number-2">4</span> Another rigorous interlude</h2>
<div class="outline-text-2" id="text-4">
<p>
(Again, skip this section if you'd like.)
</p>

<p>
If you recall from last time, we found that when calculating cardinality of types unions corresponded to addition and tuples and records correspond to multiplication. For pure  functions, the corresponding operation is exponentiation.
</p>

<p>
In symbols (with <code>σ(τ)</code> representing the cardinality of <code>tau</code>):
</p>

<pre class="example">
σ(τ =&gt; φ) = σ(φ)^σ(τ)

We can start to convince ourselves it's true with examples like:

σ(null) = 1
σ(null =&gt; null) = σ(null)^σ(null) = 1^1

function(x: null): null {
  return in;
}

But wait. Can't we also write a function like the following with a conforming type signature:

function(x: null): null {
  const a = 'ab';
  return null;
}

Yes, but we count it as morally equivalent because it is observationally
indistinguishable (i.e. if we just treat the function as a black box, feed it
inputs, and record its outputs) from the earlier function. When we talk about
implementation space, we're really talking about the size of the input to output
mapping table. Which in this case is 1.

Another example:

type Level = 'High' | 'Medium' | 'Low'
σ(boolean) = 2
σ(Level) = 3
σ(boolean =&gt; Level) = σ(Level)^σ(boolean) = 3^2

function(x: boolean): Level { return x ? 'High' : 'High'; }
function(x: boolean): Level { return x ? 'High' : 'Medium'; }
function(x: boolean): Level { return x ? 'High' : 'Low'; }
function(x: boolean): Level { return x ? 'Medium' : 'High'; }
function(x: boolean): Level { return x ? 'Medium' : 'Medium'; }
function(x: boolean): Level { return x ? 'Medium' : 'Low'; }
function(x: boolean): Level { return x ? 'Low' : 'High'; }
function(x: boolean): Level { return x ? 'Low' : 'Medium'; }
function(x: boolean): Level { return x ? 'Low' : 'Low'; }
</pre>

<div class="accordion">
<div class="accordion-head">
<p>
Practice
</p>

<p>
What's the cardinality of <code>boolean =&gt; boolean</code>?
</p>

</div>
<div class="accordion-body">
<pre class="example">
σ(boolean =&gt; boolean) = σ(boolean)^σ(boolean) = 2^2
function(x: boolean): boolean { return x ? true : true; }
function(x: boolean): boolean { return x ? true : false; }
function(x: boolean): boolean { return x ? false : true; }
function(x: boolean): boolean { return x ? false : false; }
</pre>

</div>

</div>

<p>
Again, we strive for the type with the minimum cardinality which is still compatible with our business logic.
</p>
</div>
</div>

<div id="outline-container-org70e7eb4" class="outline-2">
<h2 id="org70e7eb4"><span class="section-number-2">5</span> How</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org0c8b796" class="outline-3">
<h3 id="org0c8b796"><span class="section-number-3">5.1</span> Make illegal state unrepresentable</h3>
<div class="outline-text-3" id="text-5-1">
<p>
One obvious extension of last week is choosing input and output types that make illegal state unrepresentable.
</p>

<p>
Compare <code>promote: string =&gt; string</code> to <code>promote: Level -&gt; Level</code> (where <code>type Level = 'High' | 'Medium' | 'Low'</code>).
</p>

<p>
This change reduces our implementation space from an infinite size to a size of nine.
</p>
</div>
</div>
