blog/implementation.org
** Use generics

We've seen (at the end of the optional interlude) that a ~boolean => boolean~ has a cardinality of ~4~. If ~A~ is a type parameter, what's the cardinality of ~A => A~? That is:

#+begin_src js
const placeholder: any = undefined;
/* How many functions like this can we implement? */
function brillig<A>(a: A): A {
  return placeholder;
}
/* It turns out, just one (as long as we disallow `typeof`): */
function identity<A>(a: A): A {
  return a;
}
#+end_src

This is a general pattern. Because a function with a type parameter must work for any arbitrary type that may be substituted in, we can't do anything interesting with it, only shuffle it around. If we assume that ~A~ is a string and try to apply ~.length~, that won't work when our function is used in a different content and ~A~ is a ~boolean~.

(I generally discourage ~typeof~ in code because it's not powerful enough to work with discriminated unions and it makes the sort of reasoning we're trying to perform here harder.)

#+begin_accordion
#+begin_accordion-head
Practice

How big is the implementation space for ~(string | null, string) => string~? Compare it to ~(A | null, A) => A~ where ~A~ is a type parameter.
#+end_accordion-head
#+begin_accordion-body
# By intuition:
#+begin_src js
/* There are an infinite number of possible implementations for the first signature. Many of them are silly: */
function slithy(option: string | null, string: string): string {
  if (string === 'xyz') {
    return string + '99';
  } else {
    return string;
  }
}
/* On the other hand, there are only two implementations for the second: */
function constant<A>(option: A | null, a: A): A {
  return a;
}
function getOrElse<A>(option: A | null, a: A): A {
  return option === null ? a : option;
}

(Working with type parameters in the formal version is a bit cumbersome so we omit it.)
#+end_src
#+end_accordion-body
#+end_accordion

#+begin_trigger
Any time you're writing a library, it's worth thinking about how concrete your functionality needs to be.

Any time you're writing a function that operates on a container (including things like ~?~ and ~Promise~), you should wonder whether you can make it generic.
#+end_trigger

** Project

We'll start with a very artificial example:

#+begin_src js

/* If this is the functionality we want, our type signature is too permissive: */

function leftPositive(numbers: [number, number]): boolean {
  return (numbers[0] > 0);
}

/* We didn't use the second element of the tuple at all! Let's make that clear in our type signature: */

function positive(number: number): boolean {
  return number > 0;
}
#+end_src

What we've done is project (in the [[https://en.wikipedia.org/wiki/Projection_(relational_algebra)][relational algebra sense]]) or "prune" fields that didn't play any part in our algorithm. We can see immediately from our cardinality rules that removing fields in a product type makes the type smaller and thus our implementation space smaller. If you skipped the interludes, work through a few examples where you remove fields from a record to convince yourself that the type always has fewer inhabitants after this operation.

Let's try to make a more compelling example:

#+begin_src js
/* These aren't the focus now so we'll satisfy ourselves with mediocre types: */
type Grade = number;
type Timestamp = string;

const placeholder: any = undefined;

/* Suppose we want to calculate a user's final quiz grade based on their submitted attempts. Furthermore, suppose the correct business logic is to simply take the attempt with the maximum score. Our initial version might look like: */

type QuizAttempt = { timestamp: Timestamp, score: Grade, quizId: string };
function finalGrade(quizAttempts: Array<QuizAttempt>): ?Grade {
  return placeholder;
}
/* But with a type signature like that, we permit many bad implementations: */
function finalGradeBad(quizAttempts: Array<QuizAttempt>): ?Grade {
  if (quizAttempts.length === 0) {
    return 0.72;
  } else {
    if (quizAttempts[0].timestamp === '2017-05-10 12:00:00') {
      return 1;
    } else {
      return 0;
    }
  }
}

/* A less permissive (and thus better) type signature would be: */
function finalGradeGood(quizAttempts: Array<{ score: Grade }>): ?Grade {
  if (quizAttempts.length === 0) {
    return null;
  } else {
    return quizAttempts.reduce((acc, score) => acc.score > score.score ? acc : score);
  }
}
#+end_src

#+begin_trigger
Every time you pass a record into a function, you should consider whether you actually need every field. In particular, you should be wary of passing around full records you get from the backend unaltered.
#+end_trigger

** Import only what you need

We can move a level up and actually apply the same thinking at the module level. By importing only the functionality you need rather than every library you've ever heard of, you effectively reduce the implementation space of the module.

#+begin_src js
/* For example, when we see the following in the header of a module: */

import request from 'request';

/* we must pessimistically assume that module uses all capabilities provided by `request` until we actually examine the module code in detail.*/

/* If we had this header instead: */

import {get} from 'request';

/* it's immediately clear that we only perform fetches in this module. */
#+end_src

#+begin_trigger
You should at least consider this line of thought at every module import.
#+end_trigger

* Why

** Code quality

I'll claim three benefits of choosing type signatures with small implementation spaces.

*** Documentation

Choosing signatures with few implementations makes those signatures more informative.

Go back and look through our examples. In each case, I contend that it's easier to understand the business logic when the type signature is appropriately narrow. Our ~finalGradeGood~ signature, for example, tells us that the calculation doesn't depend on submission date and that there's no quiz-specific logic. These possibilities remain in ~finalGradeBad~ so it tells us less. Our ~identity~ function's type assures us that we perform no operations on the ~A~ and merely shuffle it around.

This intuition could be made more precise with an appeal to [[https://en.wikipedia.org/wiki/Pointwise_mutual_information][information theory]], but I'll just hand-wave in that direction for now.

