blog/implementation.html

<div id="outline-container-org31fccaf" class="outline-3">
<h3 id="org31fccaf"><span class="section-number-3">5.2</span> Use generics</h3>
<div class="outline-text-3" id="text-5-2">
<p>
We've seen (at the end of the optional interlude) that a <code>boolean =&gt; boolean</code> has a cardinality of <code>4</code>. If <code>A</code> is a type parameter, what's the cardinality of <code>A =&gt; A</code>? That is:
</p>

<div class="org-src-container">
<pre><code class="src src-js">const placeholder: any = undefined;
/* How many functions like this can we implement? */
function brillig&lt;A&gt;(a: A): A {
  return placeholder;
}
/* It turns out, just one (as long as we disallow `typeof`): */
function identity&lt;A&gt;(a: A): A {
  return a;
}
</code></pre>
</div>

<p>
This is a general pattern. Because a function with a type parameter must work for any arbitrary type that may be substituted in, we can't do anything interesting with it, only shuffle it around. If we assume that <code>A</code> is a string and try to apply <code>.length</code>, that won't work when our function is used in a different content and <code>A</code> is a <code>boolean</code>.
</p>

<p>
(I generally discourage <code>typeof</code> in code because it's not powerful enough to work with discriminated unions and it makes the sort of reasoning we're trying to perform here harder.)
</p>

<div class="accordion">
<div class="accordion-head">
<p>
Practice
</p>

<p>
How big is the implementation space for <code>(string | null, string) =&gt; string</code>? Compare it to <code>(A | null, A) =&gt; A</code> where <code>A</code> is a type parameter.
</p>

</div>
<div class="accordion-body">
<div class="org-src-container">
<pre><code class="src src-js">/* There are an infinite number of possible implementations for the first signature. Many of them are silly: */
function slithy(option: string | null, string: string): string {
  if (string === 'xyz') {
    return string + '99';
  } else {
    return string;
  }
}
/* On the other hand, there are only two implementations for the second: */
function constant&lt;A&gt;(option: A | null, a: A): A {
  return a;
}
function getOrElse&lt;A&gt;(option: A | null, a: A): A {
  return option === null ? a : option;
}

(Working with type parameters in the formal version is a bit cumbersome so we omit it.)
</code></pre>
</div>

</div>

</div>

<div class="trigger">
<p>
Any time you're writing a library, it's worth thinking about how concrete your functionality needs to be.
</p>

<p>
Any time you're writing a function that operates on a container (including things like <code>?</code> and <code>Promise</code>), you should wonder whether you can make it generic.
</p>

</div>
</div>
</div>

<div id="outline-container-orga032d43" class="outline-3">
<h3 id="orga032d43"><span class="section-number-3">5.3</span> Project</h3>
<div class="outline-text-3" id="text-5-3">
<p>
We'll start with a very artificial example:
</p>

<div class="org-src-container">
<pre><code class="src src-js">
/* If this is the functionality we want, our type signature is too permissive: */

function leftPositive(numbers: [number, number]): boolean {
  return (numbers[0] &gt; 0);
}

/* We didn't use the second element of the tuple at all! Let's make that clear in our type signature: */

function positive(number: number): boolean {
  return number &gt; 0;
}
</code></pre>
</div>

<p>
What we've done is project (in the <a href="https://en.wikipedia.org/wiki/Projection_(relational_algebra)">relational algebra sense</a>) or "prune" fields that didn't play any part in our algorithm. We can see immediately from our cardinality rules that removing fields in a product type makes the type smaller and thus our implementation space smaller. If you skipped the interludes, work through a few examples where you remove fields from a record to convince yourself that the type always has fewer inhabitants after this operation.
</p>

<p>
Let's try to make a more compelling example:
</p>

<div class="org-src-container">
<pre><code class="src src-js">/* These aren't the focus now so we'll satisfy ourselves with mediocre types: */
type Grade = number;
type Timestamp = string;

const placeholder: any = undefined;

/* Suppose we want to calculate a user's final quiz grade based on their submitted attempts. Furthermore, suppose the correct business logic is to simply take the attempt with the maximum score. Our initial version might look like: */

type QuizAttempt = { timestamp: Timestamp, score: Grade, quizId: string };
function finalGrade(quizAttempts: Array&lt;QuizAttempt&gt;): ?Grade {
  return placeholder;
}
/* But with a type signature like that, we permit many bad implementations: */
function finalGradeBad(quizAttempts: Array&lt;QuizAttempt&gt;): ?Grade {
  if (quizAttempts.length === 0) {
    return 0.72;
  } else {
    if (quizAttempts[0].timestamp === '2017-05-10 12:00:00') {
      return 1;
    } else {
      return 0;
    }
  }
}

/* A less permissive (and thus better) type signature would be: */
function finalGradeGood(quizAttempts: Array&lt;{ score: Grade }&gt;): ?Grade {
  if (quizAttempts.length === 0) {
    return null;
  } else {
    return quizAttempts.reduce((acc, score) =&gt; acc.score &gt; score.score ? acc : score);
  }
}
</code></pre>
</div>

<div class="trigger">
<p>
Every time you pass a record into a function, you should consider whether you actually need every field. In particular, you should be wary of passing around full records you get from the backend unaltered.
</p>

</div>
</div>
</div>

<div id="outline-container-orged8adbf" class="outline-3">
<h3 id="orged8adbf"><span class="section-number-3">5.4</span> Import only what you need</h3>
<div class="outline-text-3" id="text-5-4">
<p>
We can move a level up and actually apply the same thinking at the module level. By importing only the functionality you need rather than every library you've ever heard of, you effectively reduce the implementation space of the module.
</p>

<div class="org-src-container">
<pre><code class="src src-js">/* For example, when we see the following in the header of a module: */

import request from 'request';

/* we must pessimistically assume that module uses all capabilities provided by `request` until we actually examine the module code in detail.*/

/* If we had this header instead: */

import {get} from 'request';

/* it's immediately clear that we only perform fetches in this module. */
</code></pre>
</div>

<div class="trigger">
<p>
You should at least consider this line of thought at every module import.
</p>

</div>
</div>
</div>
</div>

<div id="outline-container-orga9d2766" class="outline-2">
<h2 id="orga9d2766"><span class="section-number-2">6</span> Why</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org6c5de42" class="outline-3">
<h3 id="org6c5de42"><span class="section-number-3">6.1</span> Code quality</h3>
<div class="outline-text-3" id="text-6-1">
<p>
I'll claim three benefits of choosing type signatures with small implementation spaces.
</p>
</div>

<div id="outline-container-orga7db15c" class="outline-4">
<h4 id="orga7db15c"><span class="section-number-4">6.1.1</span> Documentation</h4>
<div class="outline-text-4" id="text-6-1-1">
<p>
Choosing signatures with few implementations makes those signatures more informative.
</p>

<p>
Go back and look through our examples. In each case, I contend that it's easier to understand the business logic when the type signature is appropriately narrow. Our <code>finalGradeGood</code> signature, for example, tells us that the calculation doesn't depend on submission date and that there's no quiz-specific logic. These possibilities remain in <code>finalGradeBad</code> so it tells us less. Our <code>identity</code> function's type assures us that we perform no operations on the <code>A</code> and merely shuffle it around.
</p>

<p>
This intuition could be made more precise with an appeal to <a href="https://en.wikipedia.org/wiki/Pointwise_mutual_information">information theory</a>, but I'll just hand-wave in that direction for now.
</p>
</div>
</div>
