blog/implementation.html

<div id="outline-container-org572f638" class="outline-4">
<h4 id="org572f638"><span class="section-number-4">6.1.2</span> Reuse</h4>
<div class="outline-text-4" id="text-6-1-2">
<p>
Function type signatures with a lower cardinality are more reusable.
</p>

<p>
Go back and look through our examples. In each case, the functions can be used in more contexts. For example, <code>finalGradeGood</code> can be used even if we don't have the timestamps of the attempts at hand. If some API returned only the scores without corresponding timestamps, we'd have no choice but to rewrite <code>finalGradeBad</code>. It should be obvious that <code>identity&lt;A&gt;(a: A): A</code> can be used in more places than any <code>boolean =&gt; boolean</code>.
</p>

<p>
To see why lower cardinality functions are more reusable (skippable if your intuition is already satisfied), we'll look at how cardinality affects reuse for both:
</p>
<dl class="org-dl">
<dt>Input product types</dt><dd>We can always project from a larger product to a smaller product by forgetting some fields. We usually can't reconstruct a larger product from a smaller product. (Think <code>[number, number] =&gt; number</code> vs <code>number =&gt; [number, number]</code>.)</dd>
<dt>Output sum types</dt><dd>We can always inject a smaller sum into a larger. We have no guarantee that we the other direction is safe. (Think <code>number =&gt; ?number</code> vs <code>?number =&gt; number</code>.)</dd>
</dl>
</div>
</div>

<div id="outline-container-org177a2b0" class="outline-4">
<h4 id="org177a2b0"><span class="section-number-4">6.1.3</span> Reliability</h4>
<div class="outline-text-4" id="text-6-1-3">
<p>
Picking more restrictive type signatures means there are fewer ways for things to go wrong. We already saw some examples of bad implementations that were ruled out with better type signatures in <code>finalGradeBad</code> and <code>slithy</code>.
</p>
</div>
</div>
</div>

<div id="outline-container-org0f0e3a5" class="outline-3">
<h3 id="org0f0e3a5"><span class="section-number-3">6.2</span> Cognitive science</h3>
<div class="outline-text-3" id="text-6-2">
<div class="meta">
<p>
We're being a bit loose here about what we're considering cognitive science in an attempt to maintain thematic coherence.
</p>

</div>

<p>
Research in the psychology of programming indicates that a major part of the program comprehension process involves finding and orienting via "beacons". These beacons are salient features of the program code that allow us to understand the program and fill in the gaps without having considered every facet in detail (Our working memory is painfully limited; it allows us to retain only 2&#x2013;4 chunks at any given moment. So summarization is the name of the game.). Without having seen evidence on this exact claim, I'll suggest that type signatures are an excellent beacon. Thus, we should expect that providing informative type signatures has an outsize return on program comprehension.
</p>

<p>
<a href="https://en.wikipedia.org/wiki/Human_reliability">Human reliability</a> is a field which takes as a given that humans perform any and every action with some non-zero error rate. From this, it builds models for use in high-assurance fields like medicine and nuclear power. Without going too far down this road, we can make the same appeals. If we substitute one high relief error-prone decision (the type signature) for many low relief error-prone decisions (the implementation), we should expect the cumulative probability of error to decrease (assuming the probability of error on the first decision isn't radically higher).
</p>
</div>
</div>
</div>

<div id="outline-container-orge8ada00" class="outline-2">
<h2 id="orge8ada00"><span class="section-number-2">7</span> Summary</h2>
<div class="outline-text-2" id="text-7">
<p>
We extended the idea of cardinality of types to function types and then I advocated for picking function type signatures that are as "small" as possible. A couple of techniques that help us achieve this are the judicious use of generics and projecting product types to only contain the fields we need. This makes our code less defect-prone, more readable and more reusable.
</p>
</div>
</div>
</div>
</body>
</html>
